ROADMAP.org
#+title: Kisa project roadmap
#+author: greenfork
#+STARTUP: logdone content
   
* DONE Stage 1: Prototype [100%]
  
** DONE Handle keyboard keys
   
** DONE Draw on the terminal
   
** DONE Read file for displaying

* TODO Stage 2: Basic working program [12%]
  :PROPERTIES:
  :COOKIE_DATA: todo recursive
  :END:

  This stage should result in a basic working editor with some experimental
  features. It should provide answers to fundamental design decisions which
  should be taken further.

** TODO Write design documents [8/10]
   - [X] Client architecture
   - [X] Server architecture
   - [X] Configuration
   - [X] Cursor
   - [ ] Extensions
   - [X] Highlighting
   - [X] Keybindings
   - [X] Search
   - [X] Windowing
   - [ ] User interface
   
** TODO Client-Server communication [3/5]

*** DONE Write RPC implementation [2/2]
    CLOSED: [2021-09-02 Thu 23:39]
    - [X] Write JSON-RPC 2.0 implementation
    - [X] Wrap it into program-specific interface

*** DONE Write polling with file descriptors
    CLOSED: [2021-09-02 Thu 23:39]

*** TODO Server-side loop [2/3]
    - [X] Accept new clients
    - [X] Process client requests
    - [ ] Send notifications to clients

*** TODO Client-side loop [1/3]
    - [X] Send key presses
    - [ ] Send commands
    - [ ] Process notifications from the server

*** DONE Error handling
    CLOSED: [2021-09-02 Thu 23:45]

** TODO Terminal user interface [0/6]

*** TODO Draw on the screen

*** TODO Read keys from the keyboard

*** TODO Accumulate number multiplier
    Pressing numbers should create a multiplier for the next command, normally
    the number of times this command should be repeated.

*** TODO Draw beautiful UI boxes

*** TODO Enter command mode
    Prompt should appear where the user can type commands

*** TODO Draw cursor and selections

** TODO Windowing [0/4]
   - [ ] Evenly spaced horizontal layout
   - [ ] Evenly spaced vertical layout
   - [ ] Splits layout
   - [ ] Stack layout

** TODO State management [1/2]
   - [X] Managing resources
   - [ ] Layout of multiple splits

