docs/ROADMAP.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-03 Fri 18:48 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Kisa project roadmap</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="greenfork" />
</head>
<body>
<div id="content">
<h1 class="title">Kisa project roadmap</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdcefb6b">1. <span class="done DONE">DONE</span> Stage 1: Prototype <code>[100%]</code></a>
<ul>
<li><a href="#org9aab04c">1.1. <span class="done DONE">DONE</span> Handle keyboard keys</a></li>
<li><a href="#org90d3437">1.2. <span class="done DONE">DONE</span> Draw on the terminal</a></li>
<li><a href="#orgaf60889">1.3. <span class="done DONE">DONE</span> Read file for displaying</a></li>
</ul>
</li>
<li><a href="#org783e136">2. <span class="todo TODO">TODO</span> Stage 2: Basic working program <code>[12%]</code></a>
<ul>
<li><a href="#org66c0576">2.1. <span class="todo TODO">TODO</span> Write design documents <code>[8/10]</code></a></li>
<li><a href="#org66dc1dc">2.2. <span class="todo TODO">TODO</span> Client-Server communication <code>[3/5]</code></a>
<ul>
<li><a href="#orgccda691">2.2.1. <span class="done DONE">DONE</span> Write RPC implementation <code>[2/2]</code></a></li>
<li><a href="#org6f2274c">2.2.2. <span class="done DONE">DONE</span> Write polling with file descriptors</a></li>
<li><a href="#org169be23">2.2.3. <span class="todo TODO">TODO</span> Server-side loop <code>[2/3]</code></a></li>
<li><a href="#org8534472">2.2.4. <span class="todo TODO">TODO</span> Client-side loop <code>[1/3]</code></a></li>
<li><a href="#orgce7dd76">2.2.5. <span class="done DONE">DONE</span> Error handling</a></li>
</ul>
</li>
<li><a href="#orge286cca">2.3. <span class="todo TODO">TODO</span> Terminal user interface <code>[0/6]</code></a>
<ul>
<li><a href="#org3d7fc47">2.3.1. <span class="todo TODO">TODO</span> Draw on the screen</a></li>
<li><a href="#org79d9b0c">2.3.2. <span class="todo TODO">TODO</span> Read keys from the keyboard</a></li>
<li><a href="#org6b42a73">2.3.3. <span class="todo TODO">TODO</span> Accumulate number multiplier</a></li>
<li><a href="#orgda1ab71">2.3.4. <span class="todo TODO">TODO</span> Draw beautiful UI boxes</a></li>
<li><a href="#org6d2f226">2.3.5. <span class="todo TODO">TODO</span> Enter command mode</a></li>
<li><a href="#org141dd13">2.3.6. <span class="todo TODO">TODO</span> Draw cursor and selections</a></li>
</ul>
</li>
<li><a href="#org1ba9d86">2.4. <span class="todo TODO">TODO</span> Windowing <code>[0/4]</code></a></li>
<li><a href="#org1ac60c1">2.5. <span class="todo TODO">TODO</span> State management <code>[1/2]</code></a></li>
<li><a href="#orgedf3346">2.6. <span class="todo TODO">TODO</span> Text buffer <code>[0/2]</code></a>
<ul>
<li><a href="#org39881e1">2.6.1. <span class="todo TODO">TODO</span> Prototype <code>[0/7]</code></a></li>
<li><a href="#orgcfcf94e">2.6.2. <span class="todo TODO">TODO</span> Main implementation</a></li>
</ul>
</li>
<li><a href="#orgd5e8cad">2.7. <span class="todo TODO">TODO</span> Configuration processing <code>[1/3]</code></a>
<ul>
<li><a href="#org63cc690">2.7.1. <span class="done DONE">DONE</span> Decide on file format - zzz</a></li>
<li><a href="#org8ef2d1d">2.7.2. <span class="todo TODO">TODO</span> Read configuration <code>[1/3]</code></a></li>
<li><a href="#org3f6dc5c">2.7.3. <span class="todo TODO">TODO</span> Merge several configuration files</a></li>
</ul>
</li>
<li><a href="#org866490c">2.8. <span class="todo TODO">TODO</span> Syntax highlighting</a></li>
<li><a href="#org2275b4f">2.9. <span class="todo TODO">TODO</span> Add extension language <code>[0/3]</code></a>
<ul>
<li><a href="#org7493979">2.9.1. <span class="todo TODO">TODO</span> Decide on extension language</a></li>
<li><a href="#org5bbeebe">2.9.2. <span class="todo TODO">TODO</span> Implement event system</a></li>
<li><a href="#org4c7b4e4">2.9.3. <span class="todo TODO">TODO</span> Provide proof-of-concept implementations</a></li>
</ul>
</li>
<li><a href="#orgd579525">2.10. <span class="todo TODO">TODO</span> Integration with external tools <code>[0/4]</code></a>
<ul>
<li><a href="#org12f3e66">2.10.1. <span class="todo TODO">TODO</span> fzf</a></li>
<li><a href="#orgced7253">2.10.2. <span class="todo TODO">TODO</span> ripgrep</a></li>
<li><a href="#org6474370">2.10.3. <span class="todo TODO">TODO</span> Linting</a></li>
<li><a href="#orgee4781d">2.10.4. <span class="todo TODO">TODO</span> Formatting</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge63b5a6">3. <span class="todo TODO">TODO</span> Stage 3: Polished working program <code>[0%]</code></a>
<ul>
<li><a href="#org374498b">3.1. <span class="todo TODO">TODO</span> Write documentation</a></li>
<li><a href="#org8721a73">3.2. <span class="todo TODO">TODO</span> Finalize text buffer implementation <code>[0/2]</code></a></li>
<li><a href="#org4fd9948">3.3. <span class="todo TODO">TODO</span> Implement tower of highlighting</a></li>
<li><a href="#org4d3ff57">3.4. <span class="todo TODO">TODO</span> Decide on configuration handling</a></li>
<li><a href="#org96cb211">3.5. <span class="todo TODO">TODO</span> Search and replace</a>
<ul>
<li><a href="#org4559bf4">3.5.1. <span class="todo TODO">TODO</span> Decide which search variations to implement</a></li>
<li><a href="#org9e41afe">3.5.2. <span class="todo TODO">TODO</span> Implement searching</a></li>
<li><a href="#org34b62a8">3.5.3. <span class="todo TODO">TODO</span> Implement replacing</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5ecee19">4. <span class="todo TODO">TODO</span> Stage 4: Experimental convenience functionality <code>[0%]</code></a>
<ul>
<li><a href="#org885f241">4.1. <span class="todo TODO">TODO</span> Autocompletion</a></li>
<li><a href="#org2d6c9fd">4.2. <span class="todo TODO">TODO</span> Clipboard integration</a></li>
<li><a href="#org7212992">4.3. <span class="todo TODO">TODO</span> Jump inside file</a></li>
<li><a href="#org25b7bfc">4.4. <span class="todo TODO">TODO</span> Mouse integration</a></li>
<li><a href="#org7d4fd0d">4.5. <span class="todo TODO">TODO</span> Multiple cursors</a></li>
<li><a href="#orgb1521ab">4.6. <span class="todo TODO">TODO</span> Language server protocol</a></li>
</ul>
</li>
<li><a href="#org24e5fa1">5. <span class="todo TODO">TODO</span> Stage 5: Refined convenience functionality <code>[0%]</code></a>
<ul>
<li><a href="#orgddfd4f3">5.1. <span class="todo TODO">TODO</span> Decide on the features</a></li>
</ul>
</li>
<li><a href="#org0de2323">6. <span class="todo TODO">TODO</span> Stage 6: Final release</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdcefb6b" class="outline-2">
<h2 id="orgdcefb6b"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Stage 1: Prototype <code>[100%]</code></h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org9aab04c" class="outline-3">
<h3 id="org9aab04c"><span class="section-number-3">1.1</span> <span class="done DONE">DONE</span> Handle keyboard keys</h3>
</div>

<div id="outline-container-org90d3437" class="outline-3">
<h3 id="org90d3437"><span class="section-number-3">1.2</span> <span class="done DONE">DONE</span> Draw on the terminal</h3>
</div>

<div id="outline-container-orgaf60889" class="outline-3">
<h3 id="orgaf60889"><span class="section-number-3">1.3</span> <span class="done DONE">DONE</span> Read file for displaying</h3>
</div>
</div>

<div id="outline-container-org783e136" class="outline-2">
<h2 id="org783e136"><span class="section-number-2">2</span> <span class="todo TODO">TODO</span> Stage 2: Basic working program <code>[12%]</code></h2>
<div class="outline-text-2" id="text-2">
<p>
This stage should result in a basic working editor with some experimental
features. It should provide answers to fundamental design decisions which
should be taken further.
</p>
</div>

<div id="outline-container-org66c0576" class="outline-3">
<h3 id="org66c0576"><span class="section-number-3">2.1</span> <span class="todo TODO">TODO</span> Write design documents <code>[8/10]</code></h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Client architecture</li>
<li class="on"><code>[X]</code> Server architecture</li>
<li class="on"><code>[X]</code> Configuration</li>
<li class="on"><code>[X]</code> Cursor</li>
<li class="off"><code>[&#xa0;]</code> Extensions</li>
<li class="on"><code>[X]</code> Highlighting</li>
<li class="on"><code>[X]</code> Keybindings</li>
<li class="on"><code>[X]</code> Search</li>
<li class="on"><code>[X]</code> Windowing</li>
<li class="off"><code>[&#xa0;]</code> User interface</li>
</ul>
</div>
</div>

<div id="outline-container-org66dc1dc" class="outline-3">
<h3 id="org66dc1dc"><span class="section-number-3">2.2</span> <span class="todo TODO">TODO</span> Client-Server communication <code>[3/5]</code></h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgccda691" class="outline-4">
<h4 id="orgccda691"><span class="section-number-4">2.2.1</span> <span class="done DONE">DONE</span> Write RPC implementation <code>[2/2]</code></h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li class="on"><code>[X]</code> Write JSON-RPC 2.0 implementation</li>
<li class="on"><code>[X]</code> Wrap it into program-specific interface</li>
</ul>
</div>
</div>

<div id="outline-container-org6f2274c" class="outline-4">
<h4 id="org6f2274c"><span class="section-number-4">2.2.2</span> <span class="done DONE">DONE</span> Write polling with file descriptors</h4>
<div class="outline-text-4" id="text-2-2-2">
</div>
</div>

<div id="outline-container-org169be23" class="outline-4">
<h4 id="org169be23"><span class="section-number-4">2.2.3</span> <span class="todo TODO">TODO</span> Server-side loop <code>[2/3]</code></h4>
<div class="outline-text-4" id="text-2-2-3">
<ul class="org-ul">
<li class="on"><code>[X]</code> Accept new clients</li>
<li class="on"><code>[X]</code> Process client requests</li>
<li class="off"><code>[&#xa0;]</code> Send notifications to clients</li>
</ul>
</div>
</div>

<div id="outline-container-org8534472" class="outline-4">
<h4 id="org8534472"><span class="section-number-4">2.2.4</span> <span class="todo TODO">TODO</span> Client-side loop <code>[1/3]</code></h4>
<div class="outline-text-4" id="text-2-2-4">
<ul class="org-ul">
<li class="on"><code>[X]</code> Send key presses</li>
<li class="off"><code>[&#xa0;]</code> Send commands</li>
<li class="off"><code>[&#xa0;]</code> Process notifications from the server</li>
</ul>
</div>
</div>

<div id="outline-container-orgce7dd76" class="outline-4">
<h4 id="orgce7dd76"><span class="section-number-4">2.2.5</span> <span class="done DONE">DONE</span> Error handling</h4>
<div class="outline-text-4" id="text-2-2-5">
</div>
</div>
</div>

<div id="outline-container-orge286cca" class="outline-3">
<h3 id="orge286cca"><span class="section-number-3">2.3</span> <span class="todo TODO">TODO</span> Terminal user interface <code>[0/6]</code></h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org3d7fc47" class="outline-4">
<h4 id="org3d7fc47"><span class="section-number-4">2.3.1</span> <span class="todo TODO">TODO</span> Draw on the screen</h4>
</div>

<div id="outline-container-org79d9b0c" class="outline-4">
<h4 id="org79d9b0c"><span class="section-number-4">2.3.2</span> <span class="todo TODO">TODO</span> Read keys from the keyboard</h4>
</div>

<div id="outline-container-org6b42a73" class="outline-4">
<h4 id="org6b42a73"><span class="section-number-4">2.3.3</span> <span class="todo TODO">TODO</span> Accumulate number multiplier</h4>
<div class="outline-text-4" id="text-2-3-3">
<p>
Pressing numbers should create a multiplier for the next command, normally
the number of times this command should be repeated.
</p>
</div>
</div>

<div id="outline-container-orgda1ab71" class="outline-4">
<h4 id="orgda1ab71"><span class="section-number-4">2.3.4</span> <span class="todo TODO">TODO</span> Draw beautiful UI boxes</h4>
</div>

<div id="outline-container-org6d2f226" class="outline-4">
<h4 id="org6d2f226"><span class="section-number-4">2.3.5</span> <span class="todo TODO">TODO</span> Enter command mode</h4>
<div class="outline-text-4" id="text-2-3-5">
<p>
Prompt should appear where the user can type commands
</p>
</div>
</div>

<div id="outline-container-org141dd13" class="outline-4">
<h4 id="org141dd13"><span class="section-number-4">2.3.6</span> <span class="todo TODO">TODO</span> Draw cursor and selections</h4>
</div>
</div>

<div id="outline-container-org1ba9d86" class="outline-3">
<h3 id="org1ba9d86"><span class="section-number-3">2.4</span> <span class="todo TODO">TODO</span> Windowing <code>[0/4]</code></h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Evenly spaced horizontal layout</li>
<li class="off"><code>[&#xa0;]</code> Evenly spaced vertical layout</li>
<li class="off"><code>[&#xa0;]</code> Splits layout</li>
<li class="off"><code>[&#xa0;]</code> Stack layout</li>
</ul>
</div>
</div>

<div id="outline-container-org1ac60c1" class="outline-3">
<h3 id="org1ac60c1"><span class="section-number-3">2.5</span> <span class="todo TODO">TODO</span> State management <code>[1/2]</code></h3>
<div class="outline-text-3" id="text-2-5">
<ul class="org-ul">
<li class="on"><code>[X]</code> Managing resources</li>
<li class="off"><code>[&#xa0;]</code> Layout of multiple splits</li>
</ul>
</div>
</div>
