docs/ROADMAP.html

<div id="outline-container-orgedf3346" class="outline-3">
<h3 id="orgedf3346"><span class="section-number-3">2.6</span> <span class="todo TODO">TODO</span> Text buffer <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-org39881e1" class="outline-4">
<h4 id="org39881e1"><span class="section-number-4">2.6.1</span> <span class="todo TODO">TODO</span> Prototype <code>[0/7]</code></h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
Implementation as a simple contiguous growing array. Mainly
it is needed to understand the interface and get some idea about the kind
of processing that is necessary for common operations on the text buffer.
</p>
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Move the cursor</li>
<li class="off"><code>[&#xa0;]</code> Insert characters</li>
<li class="off"><code>[&#xa0;]</code> Multiple cursors proof-of-concept</li>
<li class="off"><code>[&#xa0;]</code> Search exact/regex</li>
<li class="off"><code>[&#xa0;]</code> Open file</li>
<li class="off"><code>[&#xa0;]</code> Open scratch buffer</li>
<li class="off"><code>[&#xa0;]</code> Search</li>
</ul>
</div>
</div>
<div id="outline-container-orgcfcf94e" class="outline-4">
<h4 id="orgcfcf94e"><span class="section-number-4">2.6.2</span> <span class="todo TODO">TODO</span> Main implementation</h4>
<div class="outline-text-4" id="text-2-6-2">
<p>
Decide on main implementation and write it. This decision is not final but
still seems necessary for a basic working program.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd5e8cad" class="outline-3">
<h3 id="orgd5e8cad"><span class="section-number-3">2.7</span> <span class="todo TODO">TODO</span> Configuration processing <code>[1/3]</code></h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org63cc690" class="outline-4">
<h4 id="org63cc690"><span class="section-number-4">2.7.1</span> <span class="done DONE">DONE</span> Decide on file format - <a href="https://github.com/gruebite/zzz">zzz</a></h4>
<div class="outline-text-4" id="text-2-7-1">
</div>
</div>
<div id="outline-container-org8ef2d1d" class="outline-4">
<h4 id="org8ef2d1d"><span class="section-number-4">2.7.2</span> <span class="todo TODO">TODO</span> Read configuration <code>[1/3]</code></h4>
<div class="outline-text-4" id="text-2-7-2">
<ul class="org-ul">
<li class="on"><code>[X]</code> Read key map</li>
<li class="off"><code>[&#xa0;]</code> Read general settings</li>
<li class="off" id="Read scopes"><code>[&#xa0;]</code> A mechanism for keeping configuration belonging to
separate domains, for example language-specific configuration.</li>
</ul>
</div>
</div>

<div id="outline-container-org3f6dc5c" class="outline-4">
<h4 id="org3f6dc5c"><span class="section-number-4">2.7.3</span> <span class="todo TODO">TODO</span> Merge several configuration files</h4>
<div class="outline-text-4" id="text-2-7-3">
<p>
Usually there are several places for configuration files which are loaded
in the order of priority.
</p>
</div>
</div>
</div>

<div id="outline-container-org866490c" class="outline-3">
<h3 id="org866490c"><span class="section-number-3">2.8</span> <span class="todo TODO">TODO</span> Syntax highlighting</h3>
<div class="outline-text-3" id="text-2-8">
<p>
The simplest possible one, just syntax tokens. Most probably implemented
with an extension language.
</p>
</div>
</div>

<div id="outline-container-org2275b4f" class="outline-3">
<h3 id="org2275b4f"><span class="section-number-3">2.9</span> <span class="todo TODO">TODO</span> Add extension language <code>[0/3]</code></h3>
<div class="outline-text-3" id="text-2-9">
</div>
<div id="outline-container-org7493979" class="outline-4">
<h4 id="org7493979"><span class="section-number-4">2.9.1</span> <span class="todo TODO">TODO</span> Decide on extension language</h4>
<div class="outline-text-4" id="text-2-9-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="https://www.lua.org/">Lua</a></li>
<li class="off"><code>[&#xa0;]</code> <a href="https://fennel-lang.org/">Fennel</a></li>
<li class="off"><code>[&#xa0;]</code> <a href="http://synthcode.com/scheme/chibi/">Chibi Scheme</a></li>
<li class="off"><code>[&#xa0;]</code> <a href="https://janet-lang.org/">Janet</a></li>
</ul>
</div>
</div>

<div id="outline-container-org5bbeebe" class="outline-4">
<h4 id="org5bbeebe"><span class="section-number-4">2.9.2</span> <span class="todo TODO">TODO</span> Implement event system</h4>
<div class="outline-text-4" id="text-2-9-2">
<p>
Events are signals emitted by the core to which the extension language can
subscribe and do desired actions. Event system is <i>de facto</i> the way the
extension language can know about anything happening in the editor.
</p>
</div>
</div>

<div id="outline-container-org4c7b4e4" class="outline-4">
<h4 id="org4c7b4e4"><span class="section-number-4">2.9.3</span> <span class="todo TODO">TODO</span> Provide proof-of-concept implementations</h4>
<div class="outline-text-4" id="text-2-9-3">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Integration with <a href="https://github.com/junegunn/fzf">fzf</a></li>
<li class="off"><code>[&#xa0;]</code> Syntax highlighting</li>
<li class="off" id="Complex commands"><code>[&#xa0;]</code> Most probably the "core" of the editor will only
provide most basic commands for manipulating the state, and the extension
language is then responsible for combining these simple commands into more
complex interactions.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgd579525" class="outline-3">
<h3 id="orgd579525"><span class="section-number-3">2.10</span> <span class="todo TODO">TODO</span> Integration with external tools <code>[0/4]</code></h3>
<div class="outline-text-3" id="text-2-10">
<p>
This will probably intersect with other sections such as extension language.
</p>
</div>

<div id="outline-container-org12f3e66" class="outline-4">
<h4 id="org12f3e66"><span class="section-number-4">2.10.1</span> <span class="todo TODO">TODO</span> fzf</h4>
</div>

<div id="outline-container-orgced7253" class="outline-4">
<h4 id="orgced7253"><span class="section-number-4">2.10.2</span> <span class="todo TODO">TODO</span> ripgrep</h4>
</div>

<div id="outline-container-org6474370" class="outline-4">
<h4 id="org6474370"><span class="section-number-4">2.10.3</span> <span class="todo TODO">TODO</span> Linting</h4>
</div>

<div id="outline-container-orgee4781d" class="outline-4">
<h4 id="orgee4781d"><span class="section-number-4">2.10.4</span> <span class="todo TODO">TODO</span> Formatting</h4>
</div>
</div>
</div>

<div id="outline-container-orge63b5a6" class="outline-2">
<h2 id="orge63b5a6"><span class="section-number-2">3</span> <span class="todo TODO">TODO</span> Stage 3: Polished working program <code>[0%]</code></h2>
<div class="outline-text-2" id="text-3">
<p>
This stage should result in a full working editor with basic features which
work well and as expected. But it does not necessarily include all the nice
convenience features which are generally expected in a modern text editor.
</p>
</div>

<div id="outline-container-org374498b" class="outline-3">
<h3 id="org374498b"><span class="section-number-3">3.1</span> <span class="todo TODO">TODO</span> Write documentation</h3>
</div>
<div id="outline-container-org8721a73" class="outline-3">
<h3 id="org8721a73"><span class="section-number-3">3.2</span> <span class="todo TODO">TODO</span> Finalize text buffer implementation <code>[0/2]</code></h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Implement several variants</li>
<li class="off"><code>[&#xa0;]</code> Benchmark them</li>
</ul>
</div>
</div>

<div id="outline-container-org4fd9948" class="outline-3">
<h3 id="org4fd9948"><span class="section-number-3">3.3</span> <span class="todo TODO">TODO</span> Implement tower of highlighting</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Experimentation with different modes for highlighting and implementation of
the "tower of highlighting". Only the basic structure should be implemented,
not necessarily all the different semantic modes.
</p>
</div>
</div>

<div id="outline-container-org4d3ff57" class="outline-3">
<h3 id="org4d3ff57"><span class="section-number-3">3.4</span> <span class="todo TODO">TODO</span> Decide on configuration handling</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Do we need extension language?</li>
<li>If we keep extension language, do we need zzz file format?</li>
</ul>
</div>
</div>

<div id="outline-container-org96cb211" class="outline-3">
<h3 id="org96cb211"><span class="section-number-3">3.5</span> <span class="todo TODO">TODO</span> Search and replace</h3>
<div class="outline-text-3" id="text-3-5">
</div>
<div id="outline-container-org4559bf4" class="outline-4">
<h4 id="org4559bf4"><span class="section-number-4">3.5.1</span> <span class="todo TODO">TODO</span> Decide which search variations to implement</h4>
<div class="outline-text-4" id="text-3-5-1">
<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Exact</li>
<li class="off"><code>[&#xa0;]</code> Exact with word boundaries</li>
<li class="off"><code>[&#xa0;]</code> Regex</li>
<li class="off"><code>[&#xa0;]</code> Exact case-insensitive</li>
<li class="off"><code>[&#xa0;]</code> Camel-Kebab-Pascal-Snake-case-insensitive</li>
<li class="off"><code>[&#xa0;]</code> PEG</li>
</ul>
</div>
</div>

<div id="outline-container-org9e41afe" class="outline-4">
<h4 id="org9e41afe"><span class="section-number-4">3.5.2</span> <span class="todo TODO">TODO</span> Implement searching</h4>
</div>
<div id="outline-container-org34b62a8" class="outline-4">
<h4 id="org34b62a8"><span class="section-number-4">3.5.3</span> <span class="todo TODO">TODO</span> Implement replacing</h4>
</div>
</div>
</div>

<div id="outline-container-org5ecee19" class="outline-2">
<h2 id="org5ecee19"><span class="section-number-2">4</span> <span class="todo TODO">TODO</span> Stage 4: Experimental convenience functionality <code>[0%]</code></h2>
<div class="outline-text-2" id="text-4">
<p>
This stage includes all the nice features which help the programmer program
quicker, faster and easier. A lot of experimental features are expected to be
here with the idea that they can be further refined, removed or changed.
</p>
</div>

<div id="outline-container-org885f241" class="outline-3">
<h3 id="org885f241"><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> Autocompletion</h3>
</div>

<div id="outline-container-org2d6c9fd" class="outline-3">
<h3 id="org2d6c9fd"><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> Clipboard integration</h3>
</div>

<div id="outline-container-org7212992" class="outline-3">
<h3 id="org7212992"><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> Jump inside file</h3>
</div>

<div id="outline-container-org25b7bfc" class="outline-3">
<h3 id="org25b7bfc"><span class="section-number-3">4.4</span> <span class="todo TODO">TODO</span> Mouse integration</h3>
</div>

<div id="outline-container-org7d4fd0d" class="outline-3">
<h3 id="org7d4fd0d"><span class="section-number-3">4.5</span> <span class="todo TODO">TODO</span> Multiple cursors</h3>
</div>

<div id="outline-container-orgb1521ab" class="outline-3">
<h3 id="orgb1521ab"><span class="section-number-3">4.6</span> <span class="todo TODO">TODO</span> Language server protocol</h3>
</div>
</div>
