ROADMAP.org
* TODO Stage 5: Refined convenience functionality [0%]

  This stage should complete and decide on all the functionality that should be
  included in the "core" of the editor, moved to third-party library or removed
  completely and left as the exercise for the reader.
  
** TODO Decide on the features
   
* TODO Stage 6: Final release

  This stage should be a release of version 1.0. After all the stages have been
  implemented and tested, this stage will stabilize the features, API and all
  the other important things so that users can expect a seamless upgrade process
  of future versions. The next breaking version will be 2.0.
  
