docs/ROADMAP.html

<div id="outline-container-org24e5fa1" class="outline-2">
<h2 id="org24e5fa1"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Stage 5: Refined convenience functionality <code>[0%]</code></h2>
<div class="outline-text-2" id="text-5">
<p>
This stage should complete and decide on all the functionality that should be
included in the "core" of the editor, moved to third-party library or removed
completely and left as the exercise for the reader.
</p>
</div>

<div id="outline-container-orgddfd4f3" class="outline-3">
<h3 id="orgddfd4f3"><span class="section-number-3">5.1</span> <span class="todo TODO">TODO</span> Decide on the features</h3>
</div>
</div>

<div id="outline-container-org0de2323" class="outline-2">
<h2 id="org0de2323"><span class="section-number-2">6</span> <span class="todo TODO">TODO</span> Stage 6: Final release</h2>
<div class="outline-text-2" id="text-6">
<p>
This stage should be a release of version 1.0. After all the stages have been
implemented and tested, this stage will stabilize the features, API and all
the other important things so that users can expect a seamless upgrade process
of future versions. The next breaking version will be 2.0.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: greenfork</p>
<p class="date">Created: 2021-09-03 Fri 18:48</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
